src/DataProcessors/МодульОбменаВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>МодульОбменаВЕТИС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнутренняяФабрикаXDTO</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыЗаявок</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОбмена</Name>
					<Comment>Интервал автоматической обмена (сек)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецификаКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаИндикацииТТН</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейХраненияЗапросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПолученияИзмененныхВСД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПолученияИзмененныхВСД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериодаПолученияВСД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПолученияВСД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеМодули</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортныйМодуль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоваяПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродукцияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродукцияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоответствуетГОСТу</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГОСТ</Name>
							<Comment>ГОСТ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаУпаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаКоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаКоличествоЕдиницВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеАнглийское</Name>
							<Comment>Английское наименование</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПродукции</Name>
							<Comment>Тип продукции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродукцияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Comment>Продукция</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродукцияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВладелецМарки</Name>
							<Comment>Владелец марки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХозяйствующийСубъект</Name>
							<Comment>ХС-производитель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УпаковкиВСД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВозврату</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньУпаковки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УровниУпаковокВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМаркировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыМаркировкиВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаркировкаВСД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маркировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМаркировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыМаркировкиВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПлощадок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/СтатусыВСДВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыВСДВЕТИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CONFIRMED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CREATED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UTILIZED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WITHDRAWN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленНаОформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленНаПроеркуУсловийРегионализации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/МодульОбменаВЕТИС/Forms/ФормаПолученияВСД/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьGuidПредприятия(Предприятие)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предприятие, "Код");
	
КонецФункции

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	Элементы.Предприятие.ТолькоПросмотр = ОтключитьПредприятие;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПредприятие(ХозяйствующийСубъект, Предприятие)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Истина КАК Предприятие
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК ТаблицаПредприятия
	|ГДЕ
	|	ТаблицаПредприятия.Ссылка = &ХозяйствующийСубъект И 
	|	ТаблицаПредприятия.Предприятие = &Предприятие
	|";
	
	Запрос.УстановитьПараметр("ХозяйствующийСубъект",  ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("Предприятие", Предприятие);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Предприятие) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ХозяйствующийСубъектПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		Если (НЕ ОтключитьПредприятие) И ЗначениеЗаполнено(Предприятие) И (НЕ ПроверитьПредприятие(ХозяйствующийСубъект, Предприятие)) Тогда
			Предприятие = Неопределено;
		КонецЕсли;
	Иначе
		Предприятие = Неопределено;
	КонецЕсли;
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.Предприятие, ХозяйствующийСубъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозяйствующийСубъектПриИзменении(Элемент)
	
	ХозяйствующийСубъектПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредприятиеПриИзменении(Элемент)
	
	ОтключитьПредприятие = НЕ ЗначениеЗаполнено(Предприятие);
	ОтключитьПредприятиеПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПредприятиеПриИзменении(Элемент)
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ДанныеДляВыгрузки = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДанныеДляВыгрузки", Неопределено);
	//ВидОперации       = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ВидОперации",       Неопределено);
	ХозяйствующийСубъект        = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ХозяйствующийСубъект",        Неопределено);
	Предприятие       = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Предприятие",       Неопределено);
	ДатаНачала        = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДатаНачала",        НачалоДня(ТекущаяДата()));
	ДатаОкончания     = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДатаОкончания",     ТекущаяДата());
	ПолучатьИзменения = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПолучатьИзменения", Ложь);
	ТипВСД            = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТипВСД",            "INCOMING");
	
	ОтключитьПредприятие = (НЕ ЗначениеЗаполнено(Предприятие));
	
	Если ПолучатьИзменения Тогда
		СтатусВСД     = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СтатусВСД",         Перечисления.СтатусыВСДВЕТИС.ПустаяСсылка());
		Элементы.ДекорацияПериод.Заголовок = "Интервал времени обновления. В список попадают все ВСД, дата последнего обновления которых попадает в указанный интервал.";
	Иначе
		СтатусВСД     = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СтатусВСД",         Перечисления.СтатусыВСДВЕТИС.CONFIRMED);
		Элементы.ДекорацияПериод.Заголовок = "Интервал времени оформления документа. В список попадают все ВСД, дата оформления которых попадает в указанный интервал. Если не указан, возвращается все имеющиеся документы.";
	КонецЕсли;
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.Предприятие, ХозяйствующийСубъект);
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

Функция ПолучитьДанныеВыгрузки()
	
	Если ЗначениеЗаполнено(Предприятие) И (НЕ ОтключитьПредприятие) Тогда
		
		guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
		
		ДанныеДляВыгрузки = Новый Структура;
		ДанныеДляВыгрузки.Вставить("ХозяйствующийСубъект",   ХозяйствующийСубъект);
		ДанныеДляВыгрузки.Вставить("Предприятие",            Предприятие);
		ДанныеДляВыгрузки.Вставить("guidПредприятия",        guidПредприятия);
		
		Если НЕ ТипВСД = "Все" Тогда
			ДанныеДляВыгрузки.Вставить("ТипВСД",             ТипВСД);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатусВСД) Тогда
			ДанныеДляВыгрузки.Вставить("СтатусВСД",          СтатусВСД);
		КонецЕсли;
		
		ДанныеДляВыгрузки.Вставить("ДатаСинхронизации",      ТекущаяДата());
		ДанныеДляВыгрузки.Вставить("ДатаНачала",             ДатаНачала);
		ДанныеДляВыгрузки.Вставить("ДатаОкончания",          ДатаОкончания);
		
	Иначе
		ОбработанныеПредприятия = Новый Массив;
		ДанныеДляВыгрузки       = Новый Массив;
		
		Предприятия = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьПредприятия(ХозяйствующийСубъект);
		
		Если Предприятия.Количество() = 0 Тогда
			ВывестиСообщение(НСтр("ru='У хоз. субъекта <%1> нет предприятий.'"),,,,, СокрЛП(ХозяйствующийСубъект));
			Возврат ДанныеДляВыгрузки;
		Иначе
			Для Каждого ТекПредприятие ИЗ Предприятия Цикл
				
				Если НЕ ОбработанныеПредприятия.Найти(ТекПредприятие) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				guidПредприятия = ПолучитьGuidПредприятия(ТекПредприятие);
				
				СтрокаВыгрузки = Новый Структура;
				СтрокаВыгрузки.Вставить("ХозяйствующийСубъект",   ХозяйствующийСубъект);
				СтрокаВыгрузки.Вставить("Предприятие",            ТекПредприятие);
				СтрокаВыгрузки.Вставить("guidПредприятия",        guidПредприятия);
				
				Если НЕ ТипВСД = "Все" Тогда
					СтрокаВыгрузки.Вставить("ТипВСД",             ТипВСД);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтатусВСД) Тогда
					СтрокаВыгрузки.Вставить("СтатусВСД",          СтатусВСД);
				КонецЕсли;
				
				СтрокаВыгрузки.Вставить("ДатаСинхронизации",      ТекущаяДата());
				СтрокаВыгрузки.Вставить("ДатаНачала",             ДатаНачала);
				СтрокаВыгрузки.Вставить("ДатаОкончания",          ДатаОкончания);
				
				ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
				
				ОбработанныеПредприятия.Добавить(ТекПредприятие);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеДляВыгрузки;
	
КонецФункции

&НаКлиенте
Процедура Запросить(Команда)
	
	//guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
	//
	//СтрокаВыгрузки = Новый Структура;
	//СтрокаВыгрузки.Вставить("ХозяйствующийСубъект",   ХозяйствующийСубъект);
	//СтрокаВыгрузки.Вставить("Предприятие",            Предприятие);
	//СтрокаВыгрузки.Вставить("guidПредприятия",        guidПредприятия);
	//
	//Если НЕ ТипВСД = "Все" Тогда
	//	СтрокаВыгрузки.Вставить("ТипВСД",             ТипВСД);
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(СтатусВСД) Тогда
	//	СтрокаВыгрузки.Вставить("СтатусВСД",          СтатусВСД);
	//КонецЕсли;
	//
	//СтрокаВыгрузки.Вставить("ДатаСинхронизации",      ТекущаяДата());
	//СтрокаВыгрузки.Вставить("ДатаНачала",             ДатаНачала);
	//СтрокаВыгрузки.Вставить("ДатаОкончания",          ДатаОкончания);
	
	ДанныеДляВыгрузки = ПолучитьДанныеВыгрузки();
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки", ДанныеДляВыгрузки);
	Если ПолучатьИзменения Тогда
		ПараметрыОткрытия.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД"));
	Иначе
		ПараметрыОткрытия.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросВсехВСД"));
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("Предприятие",          Предприятие);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры
